[{"UID":"GutierrezBasulto17","abstract":"We propose a family of probabilistic description logics (DLs) that are derived in a principledway from Halpern’s probabilistic first-order logic.  The resulting probabilistic DLs have atwo-dimensional  semantics  similar  to  temporal  DLs  and  are  well-suited  for  representingsubjective probabilities.  We carry out a detailed study of reasoning in the new family oflogics, concentrating on probabilistic extensions of the DLsALCandEL, and showing thatthe complexity ranges fromPTimeviaExpTimeand 2ExpTimeto undecidable","authors":"Víctor Gutiérrez-Basulto|Jean Christoph Jung|Carsten Lutz|Lutz Schröder","keywords":"description logics","proceedings":"Journal of Artificial Intelligence Research","title":"Probabilistic Description Logics for Subjective Uncertainty","type":"Journal","url":"https://jair.org/index.php/jair/article/view/11038/26209","year":2017},{"UID":"GogaczGIJM19","abstract":"We study the description logic SQ with number restrictions applicable to transitive roles, extended with either nominals or inverse roles. We show tight 2EXPTIME upper bounds for unrestricted entailment of regular path queries for both extensions and finite entailment of positive existential queries for nominals. For inverses, we establish 2EXPTIME-completeness for unrestricted and finite entailment of instance queries (the latter under restriction to a single, transitive role).","authors":"Tomasz Gogacz|Víctor Gutiérrez-Basulto|Yazmín Ibáñez-García| Jean Christoph Jung|Filip Murlak","proceedings":"IJCAI'19","title":"On Finite and Unrestricted Query Entailment beyond SQ with Number Restrictions on Transitive Roles","type":"Conference","url":"https://arxiv.org/pdf/2010.11503.pdf","year":2019},{"UID":"Gutierrez-Basulto18","abstract":"We study query answering in the description logic SQ supporting qualified number restrictions on both transitive and non-transitive roles. Our main contributions are a tree-like model property for SQ-knowledge bases and, building upon this, an optimal automata-based algorithm for answering positive existential regular path queries in 2EXPTIME.","authors":"Víctor Gutiérrez-Basulto|Yazmín Ibáñez-García|Jean Christoph Jung","keywords":"Description Logics|Ontologies|Query-Answering|Regular Path Queries|Transitivity|Number Restrictions","proceedings":"AAAI","title":"Answering Regular Path Queries over SQ Ontologies","type":"Conference","url":"https://ojs.aaai.org/index.php/AAAI/article/view/11539","year":2018},{"UID":"Ibanez-GarciaGS20","abstract":"Description logics (DLs) are standard knowledge representation languages for modelling ontologies, i.e. knowledge about concepts and the relations between them. Unfortunately, DL ontologies are difficult to learn from data and time-consuming to encode manually. As a result, ontologies for broad domains are almost inevitably incomplete. In recent years, several data-driven approaches have been proposed for automatically extending such ontologies. One family of methods rely on characterizations of concepts that are derived from text descriptions. While such characterizations do not capture ontological knowledge directly, they encode information about the similarity between different concepts, which can be exploited for filling in the gaps in existing ontologies. To this end, several inductive inference mechanisms have already been proposed, but these have been defined and used in a heuristic fashion. In this paper, we instead propose an inductive inference mechanism which is based on a clear model-theoretic semantics, and can thus be tightly integrated with standard deductive reasoning. We particularly focus on interpolation, a powerful commonsense reasoning mechanism which is closely related to cognitive models of category-based induction. Apart from the formalization of the underlying semantics, as our main technical contribution we provide computational complexity bounds for reasoning in EL with this interpolation mechanism.","authors":"Yazmín Ibáñez-García|Víctor Gutiérrez-Basulto|Steven Schockaert","proceedings":"KR","title":"Plausible Reasoning about EL-Ontologies using Concept Interpolation","type":"Conference","url":"https://arxiv.org/pdf/2006.14437.pdf","year":2020},{"UID":"DuboisPS17","abstract":"This paper introduces generalized possibilistic logic (GPL), a logic for epistemic reasoning based on possibility theory. Formulas in GPL correspond to propositional combinations of assertions such as “it is certain to degree λ that the propositional formula α is true”. As its name suggests, the logic generalizes possibilistic logic (PL), which at the syntactic level only allows conjunctions of the aforementioned type of assertions. At the semantic level, PL can only encode sets of epistemic states encompassed by a single least informed one, whereas GPL can encode any set of epistemic states. This feature makes GPL particularly suitable for reasoning about what an agent knows about the beliefs of another agent, e.g., allowing the former to draw conclusions about what the other agent does not know. We introduce an axiomatization for GPL and show its soundness and completeness w.r.t. possibilistic semantics. Subsequently, we highlight the usefulness of GPL as a powerful unifying framework for various knowledge representation formalisms. Among others, we show how comparative uncertainty and ignorance can be modelled in GPL. We also exhibit a close connection between GPL and various existing formalisms, including possibilistic logic with partially ordered formulas, a logic of conditional assertions in the style of Kraus, Lehmann and Magidor, answer set programming and a fragment of the logic of minimal belief and negation as failure. Finally, we analyse the computational complexity of reasoning in GPL, identifying decision problems at the first, second, third and fourth level of the polynomial hierarchy.","authors":"Didier Dubois|Henri Prade|Steven Schockaert","proceedings":"Artificial Intelligence","title":"Generalized possibilistic logic Foundations and applications to qualitative reasoning about uncertainty","type":"Journal","url":"https://www.sciencedirect.com/science/article/pii/S0004370217300875","year":2017},{"UID":"Singleton021","abstract":"Ranking the participants of a tournament has applications in voting, paired comparisons analysis, sports and other domains. In this paper we introduce bipartite tournaments, which model situations in which two different kinds of entity compete indirectly via matches against players of the opposite kind; examples include education (students/exam questions) and solo sports (golfers/courses). In particular, we look to find rankings via chain graphs, which correspond to bipartite tournaments in which the sets of adversaries defeated by the players on one side are nested with respect to set inclusion. Tournaments of this form have a natural and appealing ranking associated with them. We apply chain editing -- finding the minimum number of edge changes required to form a chain graph -- as a new mechanism for tournament ranking. The properties of these rankings are investigated in a probabilistic setting, where they arise as maximum likelihood estimators, and through the axiomatic method of social choice theory. Despite some nice properties, two problems remain an important anonymity axiom is violated, and chain editing is NP-hard. We address both issues by relaxing the minimisation constraint in chain editing, and characterise the resulting ranking methods via a greedy approximation algorithm.","authors":"Joseph Singleton|Richard Booth","proceedings":"AAMAS","title":"Rankings for Bipartite Tournaments via Chain Editing","type":"Conference","url":"https://arxiv.org/pdf/2101.02476.pdf","year":2021},{"UID":"0001V21a","abstract":"The question of conditional inference, i.e., of which conditional sentences of the form ``if A then, normally, B'' should follow from a set KB of such sentences, has been one of the classic questions of AI, with several well-known solutions proposed. Perhaps the most notable is the rational closure construction of Lehmann and Magidor, under which the set of inferred conditionals forms a rational consequence relation, i.e., satisfies all the rules of preferential reasoning, *plus* Rational Monotonicity. However, this last named rule is not universally accepted, and other researchers have advocated working within the larger class of *disjunctive* consequence relations, which satisfy the weaker requirement of Disjunctive Rationality. While there are convincing arguments that the rational closure forms the ``simplest'' rational consequence relation extending a given set of conditionals, the question of what is the simplest *disjunctive* consequence relation has not been explored. In this paper, we propose a solution to this question and explore some of its properties.","authors":"Richard Booth|Ivan Varzinczak","proceedings":"AAAI","title":"Conditional Inference under Disjunctive Rationality","type":"Conference","url":"https://ojs.aaai.org/index.php/AAAI/article/view/16774","year":2021},{"UID":"BoothC20","abstract":"The question of conditional inference, i.e., of which conditional sentences of the form ``if A then, normally, B'' should follow from a set KB of such sentences, has been one of the classic questions of AI, with several well-known solutions proposed. Perhaps the most notable is the rational closure construction of Lehmann and Magidor, under which the set of inferred conditionals forms a rational consequence relation, i.e., satisfies all the rules of preferential reasoning, *plus* Rational Monotonicity. However, this last named rule is not universally accepted, and other researchers have advocated working within the larger class of *disjunctive* consequence relations, which satisfy the weaker requirement of Disjunctive Rationality. While there are convincing arguments that the rational closure forms the ``simplest'' rational consequence relation extending a given set of conditionals, the question of what is the simplest *disjunctive* consequence relation has not been explored. In this paper, we propose a solution to this question and explore some of its properties.","authors":"Richard Booth|Jake Chandler","proceedings":"Artificial Intelligence","title":"On strengthening the logic of iterated belief revision: Proper ordinal interval operators","type":"Journal","url":"https://www.sciencedirect.com/science/article/pii/S0004370220300485","year":2020},{"UID":"abs-2012-08479","abstract":"The recent success of Bayesian methods in neuroscience and artificial intelligence gives rise to the hypothesis that the brain is a Bayesian machine. Since logic and learning are both practices of the human brain, it leads to another hypothesis that there is a Bayesian interpretation underlying both logical reasoning and machine learning. In this paper, we introduce a generative model of logical consequence relations. It formalises the process of how the truth value of a sentence is probabilistically generated from the probability distribution over states of the world. We show that the generative model characterises a classical consequence relation, paraconsistent consequence relation and nonmonotonic consequence relation. In particular, the generative model gives a new consequence relation that outperforms them in reasoning with inconsistent knowledge. We also show that the generative model gives a new classification algorithm that outperforms several representative algorithms in predictive accuracy and complexity on the Kaggle Titanic dataset.","authors":"Hiroyuki Kido|Keishi Okamoto","proceedings":"CoRR","title":"Bayes Meets Entailment and Prediction: Commonsense Reasoning with Non-monotonicity, Paraconsistency and Predictive Accuracy","type":"Journal","url":"https://arxiv.org/pdf/2012.08479.pdf","year":2020},{"UID":"abs-2005-00961","abstract":"Recent success of Bayesian methods in neuroscience and artificial intelligence gives rise to the hypothesis that the brain is a Bayesian machine. Since logic, as the laws of thought, is a product and practice of the human brain, it leads to another hypothesis that there is a Bayesian algorithm and data-structure for logical reasoning. In this paper, we give a Bayesian account of entailment and characterize its abstract inferential properties. The Bayesian entailment is shown to be a monotonic consequence relation in an extreme case. In general, it is a sort of non-monotonic consequence relation without Cautious monotony or Cut. The preferential entailment, which is a representative non-monotonic consequence relation, is shown to be maximum a posteriori entailment, which is an approximation of the Bayesian entailment. We finally discuss merits of our proposals in terms of encoding preferences on defaults, handling change and contradiction, and modeling human entailment.","authors":"Hiroyuki Kido","proceedings":"CoRR","title":"Bayesian Entailment Hypothesis: How Brains Implement Monotonic and Non-monotonic Reasoning","type":"Journal","url":"https://arxiv.org/pdf/2005.00961.pdf","year":2020},{"UID":"CaminadaMartin2021","abstract":"The connection between logic programming and formal argumentation has been studied starting from the landmark 1995 paper of Dung. Subsequent work has identified a standard translation from logic programs to (instantiated) argumentation frameworks, under which pairwise correspondences hold between various logic programming semantics and various formal argumentation semantics. This includes the correspondence between 3-valued stable and complete semantics, between well-founded and grounded semantics and between 2-valued stable (LP) and stable (argumentation) semantics. In the current paper, we show that the existing translation is able to yield the additional correspondence between ideal semantics for logic programming and ideal semantics for formal argumentation. We also show that correspondence does not hold between eager semantics for logic programming and eager semantics for formal argumentation, at least when translating from logic programming to formal argumentation. Overall, the current work should be seen as completing the analysis of correspondences between mainstream admissibility-based argumentation semantics and their logic programming counterparts.","authors":"Martin Caminada|Sri Harikrishnan|Samy Sá","proceedings":"Argument & Computation","title":"Comparing logic programming and formal argumentation; the case of ideal and eager semantics","type":"Journal","url":"https://content.iospress.com/articles/argument-and-computation/aac200528","year":2021},{"UID":"HunterPT20","abstract":"This paper introduces epistemic graphs as a generalization of the epistemic approach to probabilistic argumentation. In these graphs, an argument can be believed or disbelieved up to a given degree, thus providing a more fine–grained alternative to the standard Dung's approaches when it comes to determining the status of a given argument. Furthermore, the flexibility of the epistemic approach allows us to both model the rationale behind the existing semantics as well as completely deviate from them when required. Epistemic graphs can model both attack and support as well as relations that are neither support nor attack. The way other arguments influence a given argument is expressed by the epistemic constraints that can restrict the belief we have in an argument with a varying degree of specificity. The fact that we can specify the rules under which arguments should be evaluated and we can include constraints between unrelated arguments permits the framework to be more context–sensitive. It also allows for better modelling of imperfect agents, which can be important in multi–agent applications.","authors":"Anthony Hunter|Sylwia Polberg|Matthias Thimm","proceedings":"Artificial Intelligence","title":"Epistemic graphs for representing and reasoning with positive and negative influences of arguments","type":"Journal","url":"https://www.sciencedirect.com/science/article/pii/S0004370220300035","year":2017},{"UID":"PolbergH18","abstract":"In dialogical argumentation, it is often assumed that the involved parties will always correctly identify the intended statements posited by each other and realize all of the associated relations, conform to the three acceptability states (accepted, rejected, undecided), adjust their views whenever new and correct information comes in, and that a framework handling only attack relations is sufficient to represent their opinions. Although it is natural to make these assumptions as a starting point for further research, dropping some of them has become quite challenging. Probabilistic argumentation is one of the approaches that can be harnessed for more accurate user modelling. The epistemic approach allows us to represent how much a given argument is believed or disbelieved by a given person, offering us the possibility to express more than just three agreement states. It comes equipped with a wide range of postulates, including those that do not make any restrictions concerning how initial arguments should be viewed. Thus, this approach is potentially more suitable for handling beliefs of the people that have not fully disclosed their opinions or counterarguments with respect to standard Dung's semantics. The constellation approach can be used to represent the views of different people concerning the structure of the framework we are dealing with, including situations in which not all relations are acknowledged or when they are seen differently than intended. Finally, bipolar argumentation frameworks can be used to express both positive and negative relations between arguments. In this paper we will describe the results of an experiment in which participants were asked to judge dialogues in terms of agreement and structure. We will compare our findings with the aforementioned assumptions as well as with the constellation and epistemic approaches to probabilistic argumentation and bipolar argumentation.","authors":"Sylwia Polberg|Anthony Hunter","proceedings":"International Journal of Approximate Reasoning","title":"Empirical evaluation of abstract argumentation: Supporting the need for bipolar and probabilistic approaches","type":"Journal","url":"https://orca.cardiff.ac.uk/120622/1/dialogue_paper_5_arxiv.pdf","year":2018},{"UID":"Usashi21","abstract":"Dietary practices are governed by a mix of ethnographic aspects, such as social, cultural and environmental factors. These aspects need to be taken into consideration during an analysis of food-related queries. Queries are usually ambiguous. It is essential to understand, analyse and refine the queries for better search and retrieval. The work is focused on identifying the explicit, implicit and hidden facets of a query, taking into consideration the context – culinary domain. This article proposes a technique for query understanding, analysis and refinement based on a domain specific knowledge model. Queries are conceptualised by mapping the query term to concepts defined in the model. This allows an understanding of the semantic point of view of a query and an ability to determine the meaning of its terms and their interrelatedness. The knowledge model acts as a backbone providing the context for query understanding, analysis and refinement and outperforms other models, such as Schema.org, BBC Food Ontology and Recipe Ontology.","authors":"Usashi Chatterjee","proceedings":"Journal of Information Science","title":"Context-based understanding of food-related queries using a culinary knowledge model","type":"Journal","url":"https://journals.sagepub.com/doi/pdf/10.1177/01655515211022163","year":2021}]
